## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:104" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:104" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1be22632ee1ab33e85c29c97df525d15060c6d45b193632def35db15f53f5e12" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1775934060afd9034cde4f4988fe1faa9903007bfe6c26e4d0083c00bc9f6eac"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 104 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "1e7a0f68fac6fcb2bb33ec96d2947868-6" -> "904a8c51cee6884bf43de42fe432012c"
        id                     = "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                   = {}
      ~ version_id             = "sUnb9MYoJuLZCTC9.gukmw.tzpDtXAE0" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "575306e316a4df2229017e53bbc3f7d4-5" -> "3d046486c7ff1f36316f2ad3ab262e5d"
      ~ id                     = "processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip" -> (known after apply)
      ~ key                    = "processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip" -> "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "36a8613f29b8ad4b4989005f5906827f" -> "3d046486c7ff1f36316f2ad3ab262e5d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "U7yJ2VIerrA2m4FOP16o.8J4UZRMc5kv" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.c73ae7ae64da413d2da9e905c01e2211.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e0081b96d318ff111110005cde11c710-4" -> "5d15879e558a65bb809e6de3934fef24"
      ~ id                     = "python.c73ae7ae64da413d2da9e905c01e2211.zip" -> (known after apply)
      ~ key                    = "python.c73ae7ae64da413d2da9e905c01e2211.zip" -> "python.5d15879e558a65bb809e6de3934fef24.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "c73ae7ae64da413d2da9e905c01e2211" -> "5d15879e558a65bb809e6de3934fef24"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "s4OaKyGAKMn2NrgRY.4M7DQqKzWymKYU" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0bfdb6799fb12099a2eb0aa1cf3e3534" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "0bfdb6799fb12099a2eb0aa1cf3e3534" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "_3vKVSXvv3R9_zu1Em3skwevWrmVdY15" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "f7663d52949acfab458a10724fe1d8ad" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "f7663d52949acfab458a10724fe1d8ad" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "j1kqRvGKm4FCeYbSodqpHWjgsoTVk_fs" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0402d9169971d38e4dceeeef6b4b7624" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "0402d9169971d38e4dceeeef6b4b7624" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "AY6KfBrTy5X9Qjsz.SUin0okPd.U0Zge" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "0bfdb6799fb12099a2eb0aa1cf3e3534" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "0bfdb6799fb12099a2eb0aa1cf3e3534" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "io7yG3Tdgw2mXzYs7w1lcAazvjWVobZU" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fef71275.js"] will be destroyed
  # (because key ["static/js/app.fef71275.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.fef71275.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9485a3b11fa119f27c50e38a7c4b5398" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fef71275.js" -> null
-       key                    = "dist/static/js/app.fef71275.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fef71275.js" -> null
-       source_hash            = "9485a3b11fa119f27c50e38a7c4b5398" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "dM7a0Ku7k3o6Gk3z017yI..Xcvv_vyHk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.fef71275.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.fef71275.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.fef71275.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.fef71275.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.fef71275.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.fef71275.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "IPK3vzq2P.QR85JS1N2BgQDQQ8KUtVH6" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-18T17:10:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:71" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:71/invocations" -> (known after apply)
      ~ s3_key                         = "python.c73ae7ae64da413d2da9e905c01e2211.zip" -> "python.5d15879e558a65bb809e6de3934fef24.zip"
        tags                           = {}
      ~ version                        = "71" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
              ~ "DD_TAGS"                      = "git.commit.sha:5561ea041487adb0c5cc4c08f2fabf189cb97152,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:a641fdc3f0b2513fb3cbc85444cd43df9c75782b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "71" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:119" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:119/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "119" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
              ~ "DD_TAGS"                            = "git.commit.sha:5561ea041487adb0c5cc4c08f2fabf189cb97152,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:a641fdc3f0b2513fb3cbc85444cd43df9c75782b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "119" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-18T17:10:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:27" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:27/invocations" -> (known after apply)
      ~ s3_key                         = "processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip" -> "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip"
        tags                           = {}
      ~ version                        = "27" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
              ~ "DD_TAGS"                            = "git.commit.sha:5561ea041487adb0c5cc4c08f2fabf189cb97152,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:a641fdc3f0b2513fb3cbc85444cd43df9c75782b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "5561ea041487adb0c5cc4c08f2fabf189cb97152" -> "a641fdc3f0b2513fb3cbc85444cd43df9c75782b"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "27" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 9 to change, 8 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8743527188)*